### Import packages

In [1]:
import sqlite3
import pandas as pd

### Connect to database

In [39]:
conn = sqlite3.connect('amazon_db.db')
c = conn.cursor()

In [40]:
c.execute("""SELECT * FROM books
LIMIT 5; """)

In [41]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                                books num_copies
0         A Elephant Ate Under A Fish    4226324
1         A Boy Jumped Outside A Lake    4048899
2       One Man Hopped Under The Tree     774329
3  A Person Threw Behind The Notebook    1359606
4     The Tree Ran Through A Mountain    4703380

In [42]:
c.execute("""SELECT * FROM author
LIMIT 5; """)

In [43]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

             author                                book
0      David Taylor         A Guy Dove Outside The Desk
1    Sidney Osborne        A Fish Hopped Through A Lake
2     Robert Martin     The Woman Winced Outside A Desk
3      Greg Simpson  A Banana Winced Outside The Banana
4  Edgar Williamson      A Person Ate Behind The Potato

### Questions

1. How many rows are in the author and books tables?

2. How many authors (share) didn't sell some of their book? 

3. How many author name duplicates are there in the author table?   

4. How many authors (share) didn't sell any book?

5. Return the names of these authors.

6. How many books in total each author has sold? 

7. Choose only authors who have sold more than 400K copies
    - use subquery first
    - can you use something else? 

8. Get all authors that have their name starting with 'a'
    - Use substr first
    - Can you use a wild card? 

9. Count the number of authors that have their name starting with 'a' and that have single books that
    sold more than 200K copis
    - Can you use WITH

### 1.

In [44]:
c.execute("""SELECT count(*) AS num_rows FROM author; """)

In [45]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

   num_rows
0    100000

In [46]:
c.execute("""SELECT count(DISTINCT(author)) AS distinct_author, count(author) as total_authors FROM author; """)

In [48]:
c.execute("""SELECT count(*) num_rows FROM books; """)

In [49]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

   num_rows
0     80000

### 2.

In [69]:
c.execute("""SELECT count(DISTINCT(author)) authors_didnt_sell FROM author
LEFT JOIN books ON books.books = author.book
WHERE books IS NULL ; """)

In [70]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

   authors_didnt_sell
0               19545

# 3.

In [82]:
c.execute("""SELECT count(DISTINCT(author)) as dist_author, COUNT(author) as total FROM author ; """)

In [83]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

   dist_author   total
0        92557  100000

# 4 & 5

In [92]:
c.execute("""SELECT count(*) FROM (SELECT author, SUM(COALESCE(num_copies, 0)) authors_didnt_sell FROM author
LEFT JOIN books ON books.books = author.book
GROUP BY author
HAVING SUM(COALESCE(num_copies, 0)) = 0 ) AS bad_authors; """)

In [93]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

   count(*)
0     17724

In [94]:
## REmove outerquery to get number 5

# 6.

In [97]:
c.execute("""SELECT author, SUM(COALESCE(num_copies, 0)) total_sales FROM author
LEFT JOIN books ON books.books = author.book
GROUP BY author; """)

In [98]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                 author  total_sales
0          Aaron Agrela      4277967
1           Aaron Allen            0
2          Aaron Allman      2840107
3        Aaron Anderson      4306689
4            Aaron Baez      1039486
5            Aaron Bean      3475616
6          Aaron Becker      3630984
7           Aaron Blain            0
8           Aaron Blair      4479231
9          Aaron Blanch      2318165
10      Aaron Blanchard      2193320
11        Aaron Boehman      4301202
12        Aaron Bracero      4919319
13     Aaron Broadwater       713372
14          Aaron Brown      4997047
15        Aaron Buckley       492003
16      Aaron Burbridge       418800
17       Aaron Campbell      3522625
18      Aaron Carpenter      1909141
19        Aaron Cashman       638051
20         Aaron Caskey            0
21       Aaron Charlton       509945
22          Aaron Chong      2019555
23           Aaron Cobb      1917090
24      Aaron Coppenger      2480994
25        Aaron Coulter      1313020
26          Aaron Doten      4984760
27         Aaron Duarte            0
28         Aaron Duncan      3965498
29           Aaron Enck      3929175
...                 ...          ...
92527      Zelma Lilley      1490483
92528      Zelma Olmeda      3343166
92529       Zelma Pride      2800207
92530       Zelma Sloan      1102259
92531      Zenaida Mann      3103392
92532   Zenobia Hoglund      4297200
92533        Zina Allen      2496097
92534       Zina Fields            0
92535      Zina Herrick      2251735
92536        Zina Johns      2860527
92537       Zina Labine      3278390
92538        Zita Perez      4408577
92539     Zita Peterson      2701545
92540           Zoe Day      1037939
92541       Zoe Garrett      4331217
92542        Zoe Mojica            0
92543        Zoe Morris      2385604
92544   Zofia Rodriguez            0
92545   Zoila Blanchard      2513248
92546         Zola Hart      2877834
92547       Zola Monday      4227702
92548        Zona Garza      2992745
92549       Zonia Evans      1583450
92550     Zoraida Berry            0
92551      Zoraida Hall            0
92552  Zoraida Mcdowell      3238310
92553           Zula Ly            0
92554      Zula Skinner      3315982
92555      Zula Walther       424360
92556      Zulema Stark      3110150

[92557 rows x 2 columns]

# 7.

### a

In [100]:
c.execute("""SELECT * FROM

(SELECT author, SUM(num_copies) total_sales FROM author
LEFT JOIN books ON books.books = author.book
GROUP BY author)

WHERE total_sales > 400000
ORDER BY total_sales DESC; """)

In [101]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                     author  total_sales
0           Robert Williams     62278835
1            Robert Johnson     45011634
2                John Smith     42209406
3             William Smith     41262268
4             John Williams     41098358
5             Mary Williams     40686709
6                John Brown     40564334
7            James Williams     38274989
8              John Johnson     37746156
9             Michael Smith     37141959
10              James Smith     35570750
11            James Johnson     35044894
12             Mary Johnson     32533486
13             Joseph Smith     32531062
14              David Smith     31792538
15               John Jones     30679281
16          Michael Johnson     29125736
17               Mary Smith     28625866
18           Thomas Johnson     28302955
19               John Moore     27424071
20            James Jackson     27274947
21          Robert Anderson     26700284
22            Anthony Smith     26400587
23              Susan Smith     26062097
24          Charles Johnson     25829661
25         Michael Williams     24874415
26         Richard Williams     24108401
27             John Jackson     23846383
28              James Brown     23579169
29             James Miller     23518445
...                     ...          ...
69103       Curtis Hathaway       401508
69104       Robert Grimmett       401496
69105        Frank Mckinney       401467
69106       Catherine Haley       401344
69107          Mike Anthony       401344
69108        Patricia Jacob       401247
69109      Elizabeth Townes       401146
69110        Isabel Foskett       401146
69111  Christopher Harrison       401142
69112          Claude Wicks       401053
69113         Donald Hansen       401053
69114           David Ezell       401019
69115           Willie Ginn       401005
69116         Mabel Walters       400970
69117            Amy Duncan       400933
69118        Erik Josephson       400912
69119          Karen Mathey       400822
69120             Betty Pua       400723
69121        Joanne Peeples       400601
69122         Barbara Tudor       400503
69123         John Hatfield       400500
69124           Maureen Foy       400449
69125           Bruce James       400353
69126     Judith Greathouse       400340
69127          William Dick       400324
69128         Daniel Jordan       400322
69129       Travis Dunnaway       400284
69130        Michael Jensen       400259
69131      Jefferson Martin       400126
69132      Katherine Harper       400074

[69133 rows x 2 columns]

### b

In [102]:
c.execute("""SELECT author, SUM(num_copies) total_sales FROM author
LEFT JOIN books ON books.books = author.book
GROUP BY author
HAVING SUM(num_copies) > 400000
ORDER BY total_sales DESC; """)

In [103]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                     author  total_sales
0           Robert Williams     62278835
1            Robert Johnson     45011634
2                John Smith     42209406
3             William Smith     41262268
4             John Williams     41098358
5             Mary Williams     40686709
6                John Brown     40564334
7            James Williams     38274989
8              John Johnson     37746156
9             Michael Smith     37141959
10              James Smith     35570750
11            James Johnson     35044894
12             Mary Johnson     32533486
13             Joseph Smith     32531062
14              David Smith     31792538
15               John Jones     30679281
16          Michael Johnson     29125736
17               Mary Smith     28625866
18           Thomas Johnson     28302955
19               John Moore     27424071
20            James Jackson     27274947
21          Robert Anderson     26700284
22            Anthony Smith     26400587
23              Susan Smith     26062097
24          Charles Johnson     25829661
25         Michael Williams     24874415
26         Richard Williams     24108401
27             John Jackson     23846383
28              James Brown     23579169
29             James Miller     23518445
...                     ...          ...
69103       Curtis Hathaway       401508
69104       Robert Grimmett       401496
69105        Frank Mckinney       401467
69106       Catherine Haley       401344
69107          Mike Anthony       401344
69108        Patricia Jacob       401247
69109      Elizabeth Townes       401146
69110        Isabel Foskett       401146
69111  Christopher Harrison       401142
69112          Claude Wicks       401053
69113         Donald Hansen       401053
69114           David Ezell       401019
69115           Willie Ginn       401005
69116         Mabel Walters       400970
69117            Amy Duncan       400933
69118        Erik Josephson       400912
69119          Karen Mathey       400822
69120             Betty Pua       400723
69121        Joanne Peeples       400601
69122         Barbara Tudor       400503
69123         John Hatfield       400500
69124           Maureen Foy       400449
69125           Bruce James       400353
69126     Judith Greathouse       400340
69127          William Dick       400324
69128         Daniel Jordan       400322
69129       Travis Dunnaway       400284
69130        Michael Jensen       400259
69131      Jefferson Martin       400126
69132      Katherine Harper       400074

[69133 rows x 2 columns]

### 8.

### a

In [104]:
c.execute("""SELECT author FROM author
WHERE SUBSTR(author, 0, 2) == 'A'; """)

In [105]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                  author
0         Anthony Blache
1         Anthony Cobham
2           Aaron Latham
3             Anton Hall
4           Amber Powers
5              Ann Duong
6          Andres Miller
7          Ashley Palmer
8           Alice Wagner
9         Antwan Pereira
10         Antone Morgan
11             Anita Mix
12       Anthony Woolery
13    Antonio Mccullough
14       Augusta Darnell
15         Angie Theriot
16        Alice Alvarado
17        Albert Vincent
18         Avis Martinez
19         Anthony Smart
20        Andrew Vanhook
21         Angelo Poland
22          Adam Volkman
23       Anthony Bisarra
24            Ann Miller
25           Audra Myers
26          Alan Jimenez
27          Alexis Byrum
28         Angelia Gulke
29        Amanda Hickman
...                  ...
6415      Annie Roberson
6416     Allison Gneiser
6417    Amy Collinsworth
6418        Alberto Rayl
6419        Ann Barriere
6420         Andrew Levy
6421       Andrea Abbott
6422          Aaron Cobb
6423         Alvin Mccaw
6424    Angelique Czapla
6425   Arthur Mcgalliard
6426       Amanda Varney
6427        Alice Myrick
6428       Ashley Pinell
6429       Arletta Potts
6430       Anette Calico
6431      Angel Connolly
6432           Anna Ward
6433        Arthur Davis
6434       April Roberts
6435         Angela Pino
6436          Amy Childs
6437        Allen Mathis
6438       Andrea Raheja
6439        Alice Wexler
6440      Anne Hernandez
6441     Alphonso Mccary
6442       Antony Polowy
6443      Arlene Spataro
6444         Alma Redmon

[6445 rows x 1 columns]

### b

In [109]:
c.execute("""SELECT author FROM author
WHERE author LIKE  'A%'; """)

In [110]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                  author
0         Anthony Blache
1         Anthony Cobham
2           Aaron Latham
3             Anton Hall
4           Amber Powers
5              Ann Duong
6          Andres Miller
7          Ashley Palmer
8           Alice Wagner
9         Antwan Pereira
10         Antone Morgan
11             Anita Mix
12       Anthony Woolery
13    Antonio Mccullough
14       Augusta Darnell
15         Angie Theriot
16        Alice Alvarado
17        Albert Vincent
18         Avis Martinez
19         Anthony Smart
20        Andrew Vanhook
21         Angelo Poland
22          Adam Volkman
23       Anthony Bisarra
24            Ann Miller
25           Audra Myers
26          Alan Jimenez
27          Alexis Byrum
28         Angelia Gulke
29        Amanda Hickman
...                  ...
6415      Annie Roberson
6416     Allison Gneiser
6417    Amy Collinsworth
6418        Alberto Rayl
6419        Ann Barriere
6420         Andrew Levy
6421       Andrea Abbott
6422          Aaron Cobb
6423         Alvin Mccaw
6424    Angelique Czapla
6425   Arthur Mcgalliard
6426       Amanda Varney
6427        Alice Myrick
6428       Ashley Pinell
6429       Arletta Potts
6430       Anette Calico
6431      Angel Connolly
6432           Anna Ward
6433        Arthur Davis
6434       April Roberts
6435         Angela Pino
6436          Amy Childs
6437        Allen Mathis
6438       Andrea Raheja
6439        Alice Wexler
6440      Anne Hernandez
6441     Alphonso Mccary
6442       Antony Polowy
6443      Arlene Spataro
6444         Alma Redmon

[6445 rows x 1 columns]

### 9.

In [129]:
### With subquery

In [127]:
c.execute("""SELECT * FROM 

(SELECT author, COALESCE(num_copies, 0) AS sold FROM author
LEFT JOIN books ON books.books = author.book) AS author_books

WHERE sold > 2000000
AND author LIKE 'A%';""")

In [128]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                  author     sold
0         Anthony Blache  1425062
1         Anthony Cobham  2011172
2           Aaron Latham   354546
3              Ann Duong   708624
4          Andres Miller  2910141
5          Ashley Palmer  3543169
6           Alice Wagner  4364647
7         Antwan Pereira   827510
8          Antone Morgan  1136448
9              Anita Mix  1108072
10    Antonio Mccullough  3528785
11       Augusta Darnell  3665424
12         Angie Theriot  3110006
13        Alice Alvarado  4043378
14        Albert Vincent  1195600
15         Anthony Smart   226284
16        Andrew Vanhook  3322630
17         Angelo Poland   210709
18          Adam Volkman   452443
19       Anthony Bisarra   236939
20          Alan Jimenez  4133413
21          Alexis Byrum  3078683
22         Angelia Gulke  1314704
23        Amanda Hickman  1409688
24      Annette Anderson  1741954
25          Adolph Adams   945349
26      Alexandria Keown    77869
27         Anita Herrara  3260229
28         Alice Simmons  2303061
29          Amelia Jones  4693362
...                  ...      ...
5139       Antwan Talley  2563905
5140       Albert Parker  2854615
5141        Amy Thompson  1356114
5142      Annie Roberson  2672165
5143     Allison Gneiser  2991767
5144    Amy Collinsworth  2522785
5145        Alberto Rayl  4353344
5146        Ann Barriere  4955785
5147         Andrew Levy  3860085
5148       Andrea Abbott   995800
5149          Aaron Cobb  1917090
5150    Angelique Czapla   696487
5151   Arthur Mcgalliard   522792
5152       Amanda Varney  1761572
5153        Alice Myrick  2980013
5154       Ashley Pinell  4866640
5155       Arletta Potts   358010
5156       Anette Calico   611795
5157           Anna Ward  1068333
5158        Arthur Davis  1572719
5159       April Roberts   727444
5160          Amy Childs  2867827
5161        Allen Mathis   901756
5162       Andrea Raheja  4720633
5163        Alice Wexler   521018
5164      Anne Hernandez  2775786
5165     Alphonso Mccary  2072585
5166       Antony Polowy   259921
5167      Arlene Spataro  1570978
5168         Alma Redmon  2894925

[5169 rows x 2 columns]

In [132]:
###  With 'WITH' statement

In [130]:
c.execute(""" 
WITH author_books AS
(SELECT author, COALESCE(num_copies, 0) AS sold FROM author
LEFT JOIN books ON books.books = author.book) 
SELECT * FROM author_books
WHERE sold > 2000000
AND author LIKE 'A%';""")

In [131]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                  author     sold
0         Anthony Blache  1425062
1         Anthony Cobham  2011172
2           Aaron Latham   354546
3              Ann Duong   708624
4          Andres Miller  2910141
5          Ashley Palmer  3543169
6           Alice Wagner  4364647
7         Antwan Pereira   827510
8          Antone Morgan  1136448
9              Anita Mix  1108072
10    Antonio Mccullough  3528785
11       Augusta Darnell  3665424
12         Angie Theriot  3110006
13        Alice Alvarado  4043378
14        Albert Vincent  1195600
15         Anthony Smart   226284
16        Andrew Vanhook  3322630
17         Angelo Poland   210709
18          Adam Volkman   452443
19       Anthony Bisarra   236939
20          Alan Jimenez  4133413
21          Alexis Byrum  3078683
22         Angelia Gulke  1314704
23        Amanda Hickman  1409688
24      Annette Anderson  1741954
25          Adolph Adams   945349
26      Alexandria Keown    77869
27         Anita Herrara  3260229
28         Alice Simmons  2303061
29          Amelia Jones  4693362
...                  ...      ...
5139       Antwan Talley  2563905
5140       Albert Parker  2854615
5141        Amy Thompson  1356114
5142      Annie Roberson  2672165
5143     Allison Gneiser  2991767
5144    Amy Collinsworth  2522785
5145        Alberto Rayl  4353344
5146        Ann Barriere  4955785
5147         Andrew Levy  3860085
5148       Andrea Abbott   995800
5149          Aaron Cobb  1917090
5150    Angelique Czapla   696487
5151   Arthur Mcgalliard   522792
5152       Amanda Varney  1761572
5153        Alice Myrick  2980013
5154       Ashley Pinell  4866640
5155       Arletta Potts   358010
5156       Anette Calico   611795
5157           Anna Ward  1068333
5158        Arthur Davis  1572719
5159       April Roberts   727444
5160          Amy Childs  2867827
5161        Allen Mathis   901756
5162       Andrea Raheja  4720633
5163        Alice Wexler   521018
5164      Anne Hernandez  2775786
5165     Alphonso Mccary  2072585
5166       Antony Polowy   259921
5167      Arlene Spataro  1570978
5168         Alma Redmon  2894925

[5169 rows x 2 columns]